<?php

namespace Database\Seeders;

use App\Models\AboutPageMM;
use Illuminate\Database\Seeder;

class AboutPageMmSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            [
                "title_1" => "ကျွန်ုပ်တို့အကြောင်း",
                "title_2" => "ကျွန်ုပ်တို့ကဘာလဲ", "image_2" => "images/aboutus-1.png", "content_2" => "ဘဝက ကောင်းတယ်လို့ ငါတို့ယုံကြည်တယ်၊ ဒါကြောင့် ကျန်းမာပြီး လန်းဆန်းနေဖို့ လိုအပ်တယ်။ ကျွန်ုပ်တို့၏ ရည်မှန်းချက်မှာ လူတိုင်းအတွက် အကျိုးပြုသော၊ အဆင်ပြေသောအစားအစာများမှတစ်ဆင့် ကျန်းမာသော လူနေမှုပုံစံများကို ဖော်ဆောင်ပေးနိုင်ရန်ဖြစ်သည်။ လေးစားတန်ဖိုးထားရသော ဖောက်သည်များအား အကောင်းဆုံးနှင့် အလတ်ဆတ်ဆုံး သစ်သီးဝလံနှင့် ဟင်းသီး ဟင်းရွက်များကို ဝန်ဆောင်မှုပေးခြင်းသည် ကျွန်ုပ်တို့ စိတ်အားထက်သန်သော အရာတစ်ခုဖြစ်သည်။ ကျွန်ုပ်တို့၏ အရည်အသွေးမြင့် လတ်ဆတ်သော သစ်သီးဝလံများနှင့်ဟင်းသီးဟင်းရွက်များကို လတ်လတ်ဆတ်ဆတ် လှီးဖြတ်ပြီး ထုပ်ပိုးထားသော ထုတ်ကုန်များအဖြစ် ရရှိနိုင်သောကြောင့် အိမ်တွင်ဖြစ်စေ သွားရင်းလာရင်းဖြစ်စေ သင့်လျော် သောရွေးချယ်မှုများကို ရွေးချယ်နိုင်စေပါသည်။ FreshMoe အမှတ်တံဆိပ်သည် ထုတ်လုပ်မှုနှင့် ဝန်ဆောင်မှုကဏ္ဍများတွင် အရည်အသွေး၊ ဆန်းသစ်တီထွင်မှု၊ ယုံကြည်စိတ်ချမှုနှင့် ထုတ်ကုန်အသစ်များ ဖွံ့ဖြိုးတိုးတက်မှုတို့၏ သင်္ကေတတစ်ခုဖြစ်သည်။",
                "image_3"=> "images/ourmissionmm.png",
                "image_4"=> "images/aboutus-3.png",
                "image_5"=> "images/aboutus-5.png",
                "image_6"=> "images/ourvisionmm.png",
            ],
        ];
        foreach ($data as $value) {
            AboutPageMM::updateOrCreate($value);
        }
    }
}
