<?php

namespace Database\Seeders;

use App\Models\HomePageMM;
use Illuminate\Database\Seeder;

class HomePageMmSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            [
                "slider_title_1" => "လျင်မြန်စွာ ပို့ဆောင်ခြင်း", "slider_image_1" => "images/slider1.jpg", "slider_content_1" => "စားသုံးသူများသည် ကျွန်ုပ်တို့ထုတ်ကုန်များကို လွယ်ကူစွာရွေးချယ်ဝယ်ယူနိုင်ပြီး ထုတ်ကုန်များ၏ အကောင်းမွန် ဆုံးအခြေအနေတွင် ရောက်ရှိစေကာ လတ်ဆတ်မှုနှင့်အရည်အသွေးပြည့်ဝမှုကိုမလျော့ကျဘဲ မိမိတို့၏ အိမ်တံခါးဝသို့ အလျှင်မြန်ဆုံးအချိန်တွင်း ပို့ဆောင်ပေးမည်ဖြစ်သည်။",
                "slider_title_2" => "လျင်မြန်စွာ ပို့ဆောင်ခြင်း", "slider_image_2" => "images/slider1.jpg", "slider_content_2" => "စားသုံးသူများသည် ကျွန်ုပ်တို့ထုတ်ကုန်များကို လွယ်ကူစွာရွေးချယ်ဝယ်ယူနိုင်ပြီး ထုတ်ကုန်များ၏ အကောင်းမွန် ဆုံးအခြေအနေတွင် ရောက်ရှိစေကာ လတ်ဆတ်မှုနှင့်အရည်အသွေးပြည့်ဝမှုကိုမလျော့ကျဘဲ မိမိတို့၏ အိမ်တံခါးဝသို့ အလျှင်မြန်ဆုံးအချိန်တွင်း ပို့ဆောင်ပေးမည်ဖြစ်သည်။",
                "slider_title_3" => "လျင်မြန်စွာ ပို့ဆောင်ခြင်း", "slider_image_3" => "images/slider1.jpg", "slider_content_3" => "စားသုံးသူများသည် ကျွန်ုပ်တို့ထုတ်ကုန်များကို လွယ်ကူစွာရွေးချယ်ဝယ်ယူနိုင်ပြီး ထုတ်ကုန်များ၏ အကောင်းမွန် ဆုံးအခြေအနေတွင် ရောက်ရှိစေကာ လတ်ဆတ်မှုနှင့်အရည်အသွေးပြည့်ဝမှုကိုမလျော့ကျဘဲ မိမိတို့၏ အိမ်တံခါးဝသို့ အလျှင်မြန်ဆုံးအချိန်တွင်း ပို့ဆောင်ပေးမည်ဖြစ်သည်။",
                "slider_title_4" => "လျင်မြန်စွာ ပို့ဆောင်ခြင်း", "slider_image_4" => "images/slider1.jpg", "slider_content_4" => "စားသုံးသူများသည် ကျွန်ုပ်တို့ထုတ်ကုန်များကို လွယ်ကူစွာရွေးချယ်ဝယ်ယူနိုင်ပြီး ထုတ်ကုန်များ၏ အကောင်းမွန် ဆုံးအခြေအနေတွင် ရောက်ရှိစေကာ လတ်ဆတ်မှုနှင့်အရည်အသွေးပြည့်ဝမှုကိုမလျော့ကျဘဲ မိမိတို့၏ အိမ်တံခါးဝသို့ အလျှင်မြန်ဆုံးအချိန်တွင်း ပို့ဆောင်ပေးမည်ဖြစ်သည်။",
                "slider_title_5" => "လျင်မြန်စွာ ပို့ဆောင်ခြင်း", "slider_image_5" => "images/slider1.jpg", "slider_content_5" => "စားသုံးသူများသည် ကျွန်ုပ်တို့ထုတ်ကုန်များကို လွယ်ကူစွာရွေးချယ်ဝယ်ယူနိုင်ပြီး ထုတ်ကုန်များ၏ အကောင်းမွန် ဆုံးအခြေအနေတွင် ရောက်ရှိစေကာ လတ်ဆတ်မှုနှင့်အရည်အသွေးပြည့်ဝမှုကိုမလျော့ကျဘဲ မိမိတို့၏ အိမ်တံခါးဝသို့ အလျှင်မြန်ဆုံးအချိန်တွင်း ပို့ဆောင်ပေးမည်ဖြစ်သည်။",
                "title_2" => "ဘာကြောင့်ရွေးချယ်သင့်လဲ",
                "title_3" => "အကောင်းဆုံးလတ်ဆတ်မှု", "image_3" => "images/icon_check.png", "content_3" => "လတ်ဆတ်ပြီး အရသာရှိသော အသီးအနှံများသာ စားသုံးသူထံ‌‌ ရောက်ရှိကြောင်း သေချာစေရန် လယ်ယာမှ စျေးကွက်လုပ်ငန်းစဥ် အဆင့်တိုင်းတွင် အရည်အသွေးထိန်းချုပ်မှု အစီအမံများကို အကောင်ထည်ဖော်ဆောင် ရွက်ပါသည်။",
                "title_4" => "ဝယ်ယူရလွယ်ကူ", "image_4" => "images/icon_car.png", "content_4" => "ထုတ်ကုန်များကို ကိုယ်ပိုင်အ‌ရောင်းဆိုင်ခွဲများနှင့် ကျွန်ုပ်တို့၏စျေးဝယ်အက်ပ်လီကေးရှင်းမှတဆင့် အလွယ်တကူ‌ရွေးချယ်ဝယ်ယူနိုင်ပါသည်။",
                "title_5" => "အရည်သွေးအကောင်းဆုံး", "image_5" => "images/icon_phone.png", "content_5" => "ထုတ်ကုန်အရည်အသွေးစံချိန်စံနှုန်း မြင့်မားလာစေရန်နှင့် ဓာတုပစ္စည်းကင်းစင်စေရန် ပိုမိုအလေးထားဆောင်ရွက် မည်။",
                "title_6" => "အကောင်းဆုံးဝန်ဆောင်မှု", "image_6" => "images/icon_heart.png", "content_6" => "အရည်အသွေးမြင့် ထုတ်ကုန်များကို တိကျမြန်ဆန်ပြီး ယုံကြည်စိတ်ချရသော အိမ်အရောက်ပို့စနစ်များဖြင့် ပို့ဆောင်ပေးပြီး အကောင်းဆုံးဝန်ဆောင်မှုများကိုသာ ရရှိစေရန် လုပ်ဆောင်ထားပါသည်။",
                "title_7" => "ကျန်းမာသည့်အစာ", "image_7" => "images/icon_fruit.png", "content_7" => "အာဟာရပြည့်ဝပြီး အစားအသောက်ဘေးကင်းမှုကို ဦးစားပေးကာ ကျန်းမာရေးနှင့်ညီညတ်သည့် အရည်အသွေး မြင့်မားသော သီးနှံများကိုဖြန့်ဖြူးရောင်းချပေးသည်။",
                "title_8" => "စိတ်ကြိုက်မှာယူမှု", "image_8" => "images/icon_cart.png", "content_8" => "စားသုံးသူများ လိုအပ်သည့် ထုတ်ကုန်အရေအတွက်ပမာဏကို စိတ်ကြိုက်မှာယူနိုင်ပြီး မှာယူသည့်ပမာဏ နှင့် ရောက်စေချင်သည့်အချိန်အကန့်အသတ်အတွင်း အချိန်မှီရရှိစေပါသည်။",
                "title_9" => "ကျွန်ုပ်တို့ဘာလုပ်နေလဲ", "image_9" => "images/about1.png", "image_m_1" => "images/aboutMobile.png", "content_9" => "သုံးစွဲသူများ ဘေးကင်းပြီး ကျန်းမာရေးနှင့်ညီညွတ်သော ထုတ်ကုန်များ ရရှိစေရန်၊ ထုတ်ကုန်အရည်အသွေး စံချိန်စံညွှန်းများကို နိမ့်ကျစေခြင်း မရှိစေရန်နှင့် လူတန်းစားအားလုံးလွတ်လပ်စွာ ရွေးချယ်ဝယ်ယူနိုင်စေရန် ကျွန်ုပ်တို့ ကြိုးပမ်းဆောင်ရွက်လျက်ရှိသည်။ ဤလုပ်ငန်းနယ်ပယ်တွင် ထိပ်တန်းပံ့ပိုးသူတစ်ဦးအနေဖြင့် ကျွန်ုပ်တို့သည် ပိုမိုဆန်းသစ်သောဝန်ဆောင်မှုများ၊ အရည်အသွေးမြင့် သစ်သီးဝလံများနှင့် ဟင်းသီးဟင်းရွက်များကို ပိုမိုဖြန့်ဖြူးပေးနိုင်ရန်နှင့် ယုံကြည်စိတ်ချရမှု ရှိစေရန် ကျွန်ုပ်တို့ အမြဲလုပ်ဆောင်နေပါသည်။",
                "title_10" => "ကျွန်ုပ်တို့၏အရည်အသွေးကောင်းမွန်ပြီး လတ်ဆတ်သောအစားအစာ", "image_10" => "images/about2-1.png", "content_10" => "ရာသီအလိုက် သစ်သီး၀လံ နှင့် ဟင်းသီးဟင်းရွက် ထွက်ကုန်များမှသည် အရည်ရွှမ်းသော စတော်ဘယ်ရီ မှ ကြွပ်ဆပ်သော ဆလတ်ရွက်အထိ၊ ပစ္စည်းတစ်ခုစီတိုင်း၏ ဖွံ့ဖြိုးမှု အထွတ်အထိပ်တွင် ဂရုတစိုက် ရွေးချယ် ရိတ်သိမ်းပြီး ထုတ်ကုန်တိုင်း၏ အရသာ နှင့် အာဟာရပြည့်၀မှုကို အာမခံပါသည်။ ရေရှည်တည်တံ့သော အော်ဂဲနစ် စိုက်ပျိုးရေးနည်းစနစ်များအတွက် ကျွန်ုပ်တို့၏ စိတ်အားထက်သန်မှုကို မျှ‌ပေးသော ‌ဒေသခံ တောင်သူများ နှင့် တိုက်ရိုက်လက်တွဲခြင်းသည် ကျွန်ုပ်တို့၏ အသိုင်းအ၀ိုင်းများကို ပံ့ပိုးပေးရုံသာမက သင့်အား အလတ်ဆတ်ဆုံး နှင့် အရသာအရှိဆုံး ထုတ်ကုန်များကိုသာ ရရှိစေပါသည်။ ဆင်ပြေချောမွေ့သော လုပ်ငန်းစဥ်များ၊ ခိုင်မာသောထုတ်လုပ်မှု ကွင်းဆက်များ နှင့် ရေရှည်တည်တံ့သော စိုက်ပျိုးရေး အ‌လေ့အကျင့်များ ကိုလက်ခံကျင့်သုံးခြင်းသည် ကျွန်ုပ်တို့၏ လုပ်ငန်းဆောင်တာများ၏ အခြေခံ အဓိကအချက်ဖြစ်ပြီး နောင်လာနောင်သားမျိုးဆက်များအတွက် ပိုမိုကျန်းမာသော ဘ၀နေထိုင်မှုပုံစံကို ရရှိ စေပါသည်။",
                "title_11" => "ကျွန်ုပ်တို့၏ အော်ဂဲနစ်ခြံ", "image_11" => "images/about44.png", "image_m_2" => "images/aboutMobile2.png", "content_11" => "ကျွန်ုပ်တို့အော်ဂဲနစ်စိုက်ပျိုးရေးသည် ကျန်းမာရေးနှင့်ညီညွတ်သောအစားအစာ၊ မြေဆီလွှာကောင်းမွန်မှု၊ အပင်များနှင့် သဘာဝပတ်ဝန်းကျင်ကို ဦးစားပေး၍ သီးနှံထွက်ရှိမှုနှင့်အတူ စားနပ်ရိက္ခာဖူလုံမှုအပေါ်အခြေခံ၍ စီးပွားရေးနှင့်လူမှုရေး‌ရေရှည်တည်တံ့မှုကို ရည်ရွယ်သည့်စိုက်ပျိုးမွေးမြူရေးလုပ်ငန်းဖြစ်သည်။ ကျွန်ုပ်တို့၏ အော်ဂဲနစ်ခြံသည် မြေဆီလွှာအရည်အသွေးကို မြှင့်တင်ရန်နှင့် အော်ဂဲနစ်မြေဆီလွှာကိုတည်ဆောက်ရန်အတွက် ဓာတုဓာတ်မြေသြဇာနှင့်ကျန်းမာရေးကိုအန္တရာယ်ဖြစ်စေသည့် ပိုးသတ်ဆေးသုံးစွဲခြင်းတို့ကို ရှောင်ကျဥ်ပါသည်။ မြေဆီလွှာတွင် အော်ဂဲနစ်ဒြပ်စင်များကို မြှင့်တင်ပေးခြင်းသည် ကာဗွန်နှင့် အခြားအာဟာရဓာတ်များ စုပ်ယူမှုနှင့် သိုလှောင်မှုတွင် အထောက်အကူဖြစ်ပြီး အာဟာရပြည့်ဝသောသီးနှံများကြီးထွားရန်အတွက် အင်းဆက်ပိုးမွှားများ နှင့်ရောဂါများကို ခံနိုင်ရည်ရှိသည်။ ကျွန်ုပ်တို့အော်ဂဲနစ်စိုက်ပျိုးခြံ၏အခြေခံမူသည် မြေဆီလွှာ၊ အပင်များ၊ လူ၊ တိရိစ္ဆာန်များနှင့် သက်ရှိသတ္တဝါများ၏ ကျန်းမာရေးကိုကာကွယ်ရန်အတွက် စတင်စိုက်ပျိုးသည့် မြေပြင်ချိန်မှ စားသုံးသူလက်ဝယ်ရောက်သည်အထိ သဘာဝအတိုင်းစိုက်ပျိုးရန်ဖြစ်သည်။",
            ],
        ];
        foreach ($data as $value) {
            HomePageMM::updateOrCreate($value);
        }
    }
}
