<?php

namespace Database\Seeders;

use App\Models\ServicePageMM;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServicePageMmSeedeer extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            [
                "title_1" => "ကျွန်ုပ်တို့ဝန်ဆောင်မှုများ",
                "title_2" => "ကျွန်ုပ်တို့ဝန်ဆောင်မှုပေးသောအရာ", "content_2" => "လယ်ယာထွက် လတ်ဆတ်သော သီးနှံများမှသည် ရာသီအလိုက် ဟင်းသီးဟင်းရွက်များအထိ အမျိုးမျိုးသော ရွေးချယ်မှုဖြင့် ကျွန်ုပ်တို့သည် သင်တို့၏ နေ့စဥ်သုံး အဓိကလိုအပ်ချက်နှင့် ကျန်းမာရေးအတွက် မရှိမဖြစ် အာဟာရဓာတ်များကို ဖြည့်ဆည်းပေးပါသည်။ အရည်အသွေးမြင့် သန့်ရှင်းလတ်ဆတ်သော အော်ဂဲနစ်သီးနှံများ၊ ရာသီပေါ်သီးနှံများသာမက နိုင်ငံခြားမှ တင်ပို့သော သီးနှံများကို သင့်တင့်သောစျေးနှုန်းများဖြင့် မြို့နယ်အသီးသီးရှိ အရောင်းဆိုင်ခွဲများမှလည်းကောင်း၊ အွန်လိုင်း၀ယ်ယူမှုမှလည်းကောင်း မိမိနှစ်သက်ရာရွေးချယ်၀ယ်ယူနိုင်ပါသည်။",
                "title_3" => "လတ်ဆတ်သောထုတ်ကုန်", "image_3" => "images/ourservices-1.png", "content_3" => "ကျွန်ုပ်တို့သည် ‌ဒေသန္တရလယ်ယာများ နှင့် ယုံကြည်ရသော စိုက်ပျိုးသူများထံမှ တိုက်ရိုက်တင်သွင်းသော ရာသီအလိုက် သစ်သီး၀လံ နှင့် ဟင်းသီးဟင်းရွက် မျိုးစုံကို ခင်းကျင်းပြသပေးကာ အ‌ကောင်းဆုံး ထုတ်ကုန်များကိုသာ ရွေးချယ်နိုင်စေပါသည်။",
                "title_4" => "စိတ်ကြိုက်အော်ဒါများ", "image_4" => "images/ourservices-2.png", "content_4" => "ဖောက်သည်များအတွက် လွတ်လပ်စွာရှာဖွေရွေးချယ်၀ယ်ယူနိုင်ပြီး လွယ်ကူအဆင်ပြေသော အွန်လိုင်း စျေး၀ယ်စနစ်တစ်ခုအဖြစ် ပံ့ပိုးပေးထားပြီး စားသောက်ဆိုင်၊ ကုန်စုံဆိုင်၊ သို့မဟုတ် ပွဲများအတွက် အများအပြားလိုအပ်သည်ဖြစ်စေ သင့်လိုအပ်ချက်များ နှင့် ကိုက်ညီစေရန် စိတ်ကြိုက်မှာယူမှုများကို သီးသန့်ဆောင်ရွက်ပေးပါသည်။",
                "title_5" => "အရည်အသွေးအာမခံချက်", "image_5" => "images/ourservices-3.png", "content_5" => "လုပ်ငန်းဆိုင်ရာ စံချိန်စံညွှန်းများဖြင့် အရည်အသွေးကို တင်းကျပ်စွာ စစ်ဆေးထားပြီး ကုန်ပစ္စည်းတိုင်း သည် ကျွန်ုပ်တို့၏ ဖောက်သည်များထံ မရောက်ရှိမီ ကျွန်ုပ်တို့၏ အရည်အသွေးမြင့် စံနှုန်းများဖြင့် ပြည့်မီ ကြောင်း ပညာရှင်များနှင့် စီစစ်ရေးအဖွဲ့အစည်းများ၏ထောက်ခံချက်လက်မှတ်များဖြင့် အာမခံပါသည်။",
                "title_6" => "ကျွန်ုပ်တို့အက်ပ်လီကေးရှင်း", "image_6" => "images/about3-5.png", "content_6" => "ကျွန်ုပ်တို့အက်ပ်လီကေးရှင်းတွင် အသီးအနှံမျိုးစုံ၊ ဟင်းသီးဟင်းရွက်မျိုးစုံ၊ အော်ဂဲနစ်သီးနှံများ နှင့် ပြည်ပ ထုတ်ကုန် များကို ဝင်ရောက်ကြည့်ရှုပြီး ရွေးချယ်ဝယ်ယူနိုင်သည်။ အသုံးပြုနှစ်သက်မှုများ နှင့် ရှာဖွေကြည့်ရှုမှု မှတ်တမ်းများ အပေါ်အခြေခံ၍ ထုတ်ကုန်များကို အရည်အသွေး ကောင်းမွန်လာရေး အဆင့်သတ်မှတ်ချက်များ ပေးနိုင်ပြီး ပိုမိုအဆင်ပြေသော စျေးဝယ်အတွေ့အကြုံဖြစ်ပေါ်လာစေရန် ဖန်းတီးပေးထားသည်။ အရောင်း၊ လျှော့စျေး နှင့် ပရိုမိုးရှင်းများအကြောင်း သတိပေးချက်များ လက်ခံရရှိကာ ထုတ်ကုန် ပစ္စည်းများကို စျေးနှုန်းသင့်တင့်စွာဖြင့် ရှာဖွေဝယ်ယူနိုင်ရန် အခွင့်အလမ်းများကို တိုးမြှင့်စေသည်။ သုံးစွဲသူများသည် ၎င်းတို့၏ မှာယူမှုများကို အချိန်နှင့်တပြေးညီ သိရှိနိုင်ပြီး အက်ပ်အတွင်း ၎င်းတို့၏ ဝယ်ယူမှုမှတ်တမ်း ကိုအချိန်မ‌ရွေး ကြည့်ရှုနိုင်ခြင်းဖြင့် စျေးဝယ်သူများ ယုံကြည်စိတ်ချစေရန် ဖော်ပြထားပါသည်။ Google Play Store နှင့် App Store တွင် ကျွန်ုပ်တို့၏ FreshMoe စျေးဝယ်အက်ပ်ကို ဒေါင်းလုဒ်လုပ်ကာ စတင်အသုံးပြုနိုင်ပါသည်။",
                "title_7" => "Retail Shop", "image_7" => "images/RetailShop.png", "content_7" => "ကျွန်ုပ်တို့၏လက်လီအရောင်းဆိုင်တွင် စျေးဝယ်ရခြင်းသည် သုံးစွဲသူများအား အရည်အသွေးအမြင့်မားဆုံး သစ်သီး ဝလံနှင့် ဟင်းသီးဟင်းရွက်များ၊ အလွန်ကောင်းမွန်သော ဝန်ဆောင်မှုနှင့် ပျော်ရွှင်စရာကောင်းပြီး အဆင်ပြေသည့် စျေးဝယ်အတွေ့အကြုံကို ရရှိစေပါသည်။ ကျွန်ုပ်တို့၏ စတိုးဆိုင်အပြင်အဆင်သည် ထုတ်ကုန်များကို လွယ်ကူစွာ ရွေးချယ်နိုင်ပြီး သင်၏စျေးဝယ်ခြင်းကို လွယ်ကူမြန်ဆန်စေရန်အတွက် စနစ်တကျ ဒီဇိုင်းထုတ်ထားပါသည်။ စျေးဝယ်သူတို့၏ စိတ်ကျေနပ်မှုသည် ကျွန်ုပ်တို့၏ ထိပ်တန်းဦးစားပေးဖြစ်သည်။ ကျွန်ုပ်တို့၏လက်လီအရောင်းဆိုင် တွင် ရာသီအလိုက်အသီးအနှံများမှ နေ့စဥ်ဟင်းသီးဟင်းရွက်များအထိ ၎င်းတို့နှင့်ဆက်စပ်သောထုတ်ကုန်များကို ကျယ်ပြောသောရွေးချယ်မှုများဖြင့် သင်တို့ ချက်ပြုတ်ရာတွင် လိုအပ်သောအရာများကို ဖြည့်ဆည်းပေးထားသည်။ အော်ဂဲနစ်ထွက်ကုန်များကို နှစ်သက်သူများအတွက် ဓာတုပိုးသတ်ဆေးနှင့် ဓာတ်မြေသြဇာများ ကင်းစင်သော အော်ဂဲနစ်သီးနှံများနှင့် ဟင်းသီးဟင်းရွက်မျိုးစုံတို့ကို ရွေးချယ်ဝယ်ယူနိုင်ပြီး သင်တို့ကို ကျန်းမာစွာနေထိုင်နိုင်ရန် အထောက်အကူပြုပါသည်။ ကျွန်ုပ်တို့ဆိုင်ခွဲများတွင် ဝယ်ယူအားပေးသော စားသုံးသူများ အဆင်ပြေလွယ်ကူစေရန် ငွေပေးချေရာတွင် ငွေသားပေးချေမှုအပြင် အွန်လိုင်းငွေပေးချေမှုစနစ်ဖြင့်လည်း ဝယ်ယူနိုင်ရန်လုပ်ဆောင်ထားပါသည်။",
            ],
        ];
        foreach ($data as $value) {
            ServicePageMM::updateOrCreate($value);
        }
    }
}
